{
  "user_data": {
    "username": "TryingTris",
    "posts": [
      {
        "id": "1lziwly",
        "title": "Teddy Bear Corner",
        "text": "I was on a motorcycle trip, leaving Lake Viva Naughton, \\~22 miles away from the nearest paved road I run into this absolutely random thing. It was slightly creepy but also somewhat fascinating. There are a couple of articles about it online but nothing with concrete info on it from what I recall.",
        "subreddit": "creepy",
        "score": 33,
        "num_comments": 1,
        "created_utc": 1752489112.0,
        "url": "https://www.reddit.com/gallery/1lziwly"
      },
      {
        "id": "1kdeqmo",
        "title": "SP9A3 New US Made Mags - Not Dropping Free",
        "text": "Got my SP9A3S in last week and was finally able to go shoot it yesterday. It came with the 3 curved black mags instead of the translucent ones, which I assume are the newest US made mags.\n\nWhen I got it the mags drop free completely fine. As soon as it was fired, starting from the very first mag it just doesn't anymore. I'm not sure if it's residue or heat causing it but it happens with all 3 mags. The good news is that it cycled all of my 115 gr S&B ammo without issues whatsoever.\n\nAnyone else have a similar experience? \n\nI've heard that the Global Ordinance mags are good but there aren't a lot of feedback on those yet.",
        "subreddit": "GrandPowerStribog",
        "score": 5,
        "num_comments": 16,
        "created_utc": 1746227714.0,
        "url": "https://www.reddit.com/r/GrandPowerStribog/comments/1kdeqmo/sp9a3_new_us_made_mags_not_dropping_free/"
      },
      {
        "id": "1jcg1hn",
        "title": "Tour pictures from the past ~3 years",
        "text": "",
        "subreddit": "MT09",
        "score": 78,
        "num_comments": 23,
        "created_utc": 1742109362.0,
        "url": "https://www.reddit.com/gallery/1jcg1hn"
      },
      {
        "id": "1jc5a31",
        "title": "Question for HEB Staff - Curbside in Particular",
        "text": "To preface this, I really love the convenience of HEB curbside, and I utilize it probably once or twice a month going on the last 6 months. It's an invaluable service to me and it's improved my quality of life measurably.\n\nSo my question is:\n\nIs there a reason that the curbside service use so many plastic bags? My recent order had a lot of produce in it and every single item was in a different HEB plastic bag. 1 bag for an onion, 1 bag for 2 poblanos, 1 bag for cilantro, 1 bag for 2 serranos, 1 bag for 6 tomatillos, etc... I counted 24 plastic bags for an order that could probably fit easily in 6 or 7 plastic bags. \n\nIt's not location dependent, I feel like every location I've been to does this (Bunker Hill, Buffalo/Washington, & W. Alabama). Is it simply cost vs convenience/efficiency? ",
        "subreddit": "houston",
        "score": 19,
        "num_comments": 25,
        "created_utc": 1742073032.0,
        "url": "https://www.reddit.com/r/houston/comments/1jc5a31/question_for_heb_staff_curbside_in_particular/"
      },
      {
        "id": "1i6lq8n",
        "title": "Tax Question for 2025 - Move from TX to VA, but still working in TX",
        "text": "Hi Everyone, I've tried to search this subreddit for a scenario similar to mine and found some information but I'm not sure how definitive it is quite yet.\n\nI work in TX, and as of Jan 4th 2025, moved to VA to live with my mother for health reasons.\n\nMy living and work situation for 2025 will basically be:\n\n* Spending 2 weeks in VA\n* Commuting back to TX (2-3 days)\n* 3 weeks work tour in TX\n* Commuting back to VA (2-3 days)\n\nI work a rotational shift work job so I will effectively only be in VA for \\~18 weeks/126 days in 2025. During the rest of the time that I'm in TX I will be living in a corporate housing situation, and will effectively not have a permanent residency address in TX. However I do have family in TX and could opt to move in with them on my work visits instead, if that has a tax implication one way or another. I plan on keeping my TX drivers license, and I have a car and motorcycle which are titled and registered in TX and should remain as such.\n\nThe move is most likely temporary with the hopes that my mother's health will improve in the next 1 - 2 years with consistent follow up on doctor's visit and medication regimen.\n\nMy questions are:\n\n1. Do I still need to file a VA tax return if I spend less than 183 days in VA?\n2. Do I file a non-resident tax return and claim exemption since I'm there less than 183 days in the year?\n3. Would anything change if I update my home address to VA with my employer? I assume my tax withholding will increase to account for potential state income tax but should be refunded once I file taxes?\n4. Same question for my credit cards bills/mailing address. If I update it to VA does it have any tax implications down the road?\n5. While I won't have a lease/rental agreement, I will be helping my sister (who owns the house) pay part of the mortgage (basically sending her money over zelle). Does this have any impact on my end?\n6. Is it a dick move to not want to pay the full amount of state income tax in VA if I'm only there for \\~1/3 of the year?\n\nI've been mostly fretting over what I'm going to do with my current bills/home address in the fear that changing them could somehow shove me into a disadvantageous tax position.\n\nThank you in advance for any input!\n\n  \nEdit:\n\nFollow-up. I consulted a tax lawyer and was told that basically since I will be spending less than 183 days in VA I will not be considered a resident for tax purposes and will not need to file a VA tax return. Simple as that. He also recommended keeping a low profile and just keeping my mailing addresses in TX to avoid any complications.",
        "subreddit": "tax",
        "score": 2,
        "num_comments": 5,
        "created_utc": 1737474928.0,
        "url": "https://www.reddit.com/r/tax/comments/1i6lq8n/tax_question_for_2025_move_from_tx_to_va_but/"
      },
      {
        "id": "1b9b64v",
        "title": "Buying Advice Wanted for Apartment Setup",
        "text": "Hi everyone, I'm a complete beginner when it comes to the projector world and I'd love some advice to nail down the right setup for me within budget. Per the Wiki here's my info\n\n&#x200B;\n\n1. Maximum budget - $2000 (prefer to keep it to $1500 if possible but if the $500 bump results in significant quality upgrade then I'm in, can stretch to $2500 if needed though that will delay the project since I'll need to save more money).\n2. Screen size - 135\" (I have pretty tall ceilings, \\~150\" or so and could probably go bigger if it optimizes the setup)\n3. Distance from back wall or preferred mounting position to screen wall - \\~160\" will be mounted on a shelf on the back wall\n4. Seating distance to screen - 140\"-150\"\n5. How will you mount? - Rear Shelf/Cabinet.\n6. Usage - 50% movies / 50% gaming.\n7. Room type - Living room.\n8. Ambient  light, through lighting or light leakage from windows? - Minimal ambient light. 1 window in living room that can have blackout curtains installed and would essentially give me pitch black condition.\n9. Room colors - Walls (beige), Ceiling (beige), and floors (wood floors, med dark brown).\n\n&#x200B;\n\nSome other info, this will be my primary and likely only screen setup at home so I would like the flexibility of using it with some lights on in my living room if possible. I would like to avoid the added cost of an acoustic perf screen as I'll probably keep it simple with a soundbar below the screen.\n\nI like the BenQ TK700STi but if I'm using the throw calculator correctly it puts out a massive +170\" diagonal screen at \\~160\", I'm not against it but I need to double check to see if I can pull it off (both on physical size and on additional cost). I like the Android TV feature on it and would likely utilize that a ton. \n\n\\[edit\\] - I just realized that the \"ST\" stands for short throw and I could probably just go with the TK700 and benefit from all the same features of the TK700STi minus the android dongle. \\[/edit\\]\n\nI've seen Silver Ticket screens mentioned for pretty good budget screens on a fixed frame and would probably go that way unless a better option is available?\n\n&#x200B;\n\nThanks in advance for the input!",
        "subreddit": "projectors",
        "score": 0,
        "num_comments": 8,
        "created_utc": 1709860938.0,
        "url": "https://www.reddit.com/r/projectors/comments/1b9b64v/buying_advice_wanted_for_apartment_setup/"
      },
      {
        "id": "o7jj1z",
        "title": "Has Anybody Done Durian?",
        "text": "Polling my ASEAN brothers and sisters here. Anyone attempted a durian hooch? If so, how did it turn out? If not I may have to go for it out of curiosity.",
        "subreddit": "prisonhooch",
        "score": 15,
        "num_comments": 15,
        "created_utc": 1624609660.0,
        "url": "https://www.reddit.com/r/prisonhooch/comments/o7jj1z/has_anybody_done_durian/"
      },
      {
        "id": "n40w8u",
        "title": "Rainy 2 Days in Pedernales Falls State Park",
        "text": "",
        "subreddit": "backpacking",
        "score": 2,
        "num_comments": 2,
        "created_utc": 1620060368.0,
        "url": "https://imgur.com/a/ZiVKJGi"
      },
      {
        "id": "ms30an",
        "title": "Anvil Foundry Burn Incident",
        "text": "Alright.... who was it...?\n\n[https://imgur.com/JqsM9dn](https://imgur.com/JqsM9dn)\n\nI assume it boiled over and shot out the hole? I'm not sure since there aren't additional details. I have boiled with the lid on before but not completely closed (cracked open) and definitely not clamped. Hope they're recovering well!",
        "subreddit": "Homebrewing",
        "score": 56,
        "num_comments": 36,
        "created_utc": 1618579262.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/ms30an/anvil_foundry_burn_incident/"
      },
      {
        "id": "i8al2v",
        "title": "Outdoor Research up to 50% Off",
        "text": "",
        "subreddit": "frugalmalefashion",
        "score": 107,
        "num_comments": 22,
        "created_utc": 1597224011.0,
        "url": "https://www.outdoorresearch.com/us/mens-sale"
      },
      {
        "id": "fk4g5a",
        "title": "Marc Rebillet Live Stream - \"Quaranstream\"",
        "text": "",
        "subreddit": "videos",
        "score": 3,
        "num_comments": 2,
        "created_utc": 1584448369.0,
        "url": "https://www.youtube.com/watch?v=pLvY9M-RcFk"
      },
      {
        "id": "fhp8nz",
        "title": "Houston Show 2 Free Tickets",
        "text": "I have 2 tickets to tonight's show. Just started coming down with flu-ish symptoms yesterday and out of an abundance of caution I won't be attending the show. My friend who's supposed to go with me doesn't want to to alone.  \n\nWilling to meet in East Houston to hand tickets over. I'm right by the Harris County Constable Precinct 6 office, on 5900 Canal.  \n\nSorry for the last minute, honestly didn't even think to list it on here since the show isn't sold out last I checked. I'll bring hand sanitizer so you canv de-germ yourself haha.",
        "subreddit": "loopdaddy",
        "score": 3,
        "num_comments": 4,
        "created_utc": 1584053131.0,
        "url": "https://www.reddit.com/r/loopdaddy/comments/fhp8nz/houston_show_2_free_tickets/"
      },
      {
        "id": "e60npp",
        "title": "LG G7 Dialing Keypad Sounds Keeps Coming Back On",
        "text": "Hi folks,  \n\nI'm originally from the US. Currently traveling in Europe. For some reason the setting for the dialing keypad sounds keep coming on. I turn it off and the setting reverts itself.  \n\nThat's not the only thing that's affected, the screen time out time is reset to default, as well as the touch sound.  \n\nIt's driving me insane and Google isn't really resulting in any helpful search results. Anybody seen this before?",
        "subreddit": "GoogleFi",
        "score": 1,
        "num_comments": 0,
        "created_utc": 1575472563.0,
        "url": "https://www.reddit.com/r/GoogleFi/comments/e60npp/lg_g7_dialing_keypad_sounds_keeps_coming_back_on/"
      },
      {
        "id": "dxvnki",
        "title": "Finalized Pack List - 2 Weeks in Europe (Netherlands/Prague)",
        "text": "Folks, \n\nI posted a while back looking for input on my initial packing list. I've since then tried out different configurations and I think I've settled on this. It's still a bit more than I may need (specifically regarding the gloves, extra pair of pants, and rain coat) but I'm not going to skip them for now just for comfort sake.\n\nThe bag is a Tortuga Setout Divide btw.\n\n&#x200B;\n\nPacking list so far:\n\n* Toiletries (Dr. Bronner's soap, razor and handle, deodorant, face lotion, beard oil-argan?, q-tips, toothbrush, toothpaste, cologne, comb, tooth syringe)\n* Meds Pack (ibuprofen, melatonin, benadryl, tums, imodium ad)\n* Patagonia minimalist wading jacket\n* Patagonia nanopuff\n* Wool beanie\n* Buff\n* Glove liners\n* Gloves\n* 2 long sleeve shirts\n* 1 turtleneck\n* 2 pairs heattech shirt\n* Lounging around shorts\n* Navy corduroys\n* 2 extra pair socks (wool) - 1 WORN on flight\n* 4 extra pair underwear (synthetic, wool/airism) - 1 WORN on flight\n* Turtleneck (gray)\n* Travel adapter plug\n* Anker charger\n* USB C - HDMI port (Satechi)\n* USB C cable for phone\n* USB C cable for Surface Go\n* Surface Go\n* Battery bank and cable\n* One wipe Charlies\n* Daypack for EDC\n* Bose headphones\n* Protein bars?\n\n&#x200B;\n\nWorn or in Pockets\n\n* Passport\n* Wallet\n* Chapstick\n* Patagonia hoodie\n* T shirt\n* Jeans or Chino\n* Navy belt\n* Underwear\n* Wool socks\n* Chucks (red leather?)\n\n&#x200B;\n\nBuy in Amsterdam\n\n* 2 pairs Heattech leggings (Uniqlo)\n* 1 pair Heattech LS shirt (Uniqlo)\n* Body lotion (HEMA?)\n\n&#x200B;\n\nI know I'll be needing the leggings while in Prague because the weather seems like it would be quite a bit colder compared to the Netherlands. I plan on buying them in the Amsterdam Uniqlo. Link to pictures is at the bottom of this post. I ended up changing  the configuration last minute and packed it into two medium packing cubes instead of the one medium and one small you see in the pictures. Ended up spreading out the items a bit so it's not too thick, easier to zip up the bag.\n\n&#x200B;\n\n [https://imgur.com/a/Li1NViS](https://imgur.com/a/Li1NViS)",
        "subreddit": "onebag",
        "score": 14,
        "num_comments": 6,
        "created_utc": 1574038544.0,
        "url": "https://www.reddit.com/r/onebag/comments/dxvnki/finalized_pack_list_2_weeks_in_europe/"
      },
      {
        "id": "djpukt",
        "title": "Anvil Foundry Problem - Powers On but Not Heating Up",
        "text": "Wondering if anybody that has an Anvil Foundry may have ran into this issue? I've tried searching reddit/google and came up empty.\n\nI bought one of the new runs of the Anvil Foundry 10.5 gallon system. It was delivered on Thursday. I set it up yesterday and connected it to my kitchen GFCI outlet for a test run to see how long it would take to heat up strike water, how well it would hold temp if I just cut the power and let it sit for an hour, etc...\n\nHere's what I did:\n\n1. Filled the vessel with 7.5 gallons of water (most of the parts came pre-installed, I just had to screw on the spigot valve handle).\n2. Connected to a GFCI outlet and powered the system on. The temp controller powers on with no issues, all buttons function as expected.\n3. Left the temperature setting as F, and set it to 152 degF.\n4. Set the power at 100%, heard the fan kick on which I thought may have indicated the heating element is on.\n5. Waited.\n\nNothing happened. Water did not heat up in the slightest. The water was at 77 degF to start, and did not gain a single degF in an hour. I don't think it's a breaker issue because the whole temp control unit is powering on. Unless they have separate breakers for the temperature controller and the heating element? If that's the case I don't know where the location of the other breaker is.\n\nI already emailed Anvil support last night and I'm waiting for a response. Tried calling them today but I lost track of time and called outside their support hours. I'm sure they'll get back in touch eventually but I don't know if it'll be before the weekend and I'm really just curious if this could have been operator error or perhaps a simple fix?\n\n&#x200B;\n\nEdit: Got in touch with Doug from the Blichmann group and he pulled a Foundry 10.5 gal unit, tested it to make sure it heats up just fine, and packed it up for shipment later today. I'll just need to send mine back. Didn't get any troubleshooting tips but I do plan on keeping in touch to see if there was anything I could have done to rectify the situation.\n\n&#x200B;\n\nEdit 2: The new shipped unit works fine, I had a brew day with it and for the most part it's what I expected. Heating times are surprisingly quick, faster than my Unibrau V2 setup. Boil is way more vigorous as well.",
        "subreddit": "Homebrewing",
        "score": 5,
        "num_comments": 16,
        "created_utc": 1571415703.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/djpukt/anvil_foundry_problem_powers_on_but_not_heating_up/"
      },
      {
        "id": "cmf6xo",
        "title": "2 Week Trip to Amsterdam and Prague in December",
        "text": "I'm starting to create a packing list in anticipation of this trip, it's by no means polished or anything. I usually start a few months ahead and keep the list in Google Keep, and add/remove stuff as I think of them here and there. Anyway here's what I have so far and some notes I have on them. Any input is welcomed.\n\n \n\n* Toiletries\n   * Dr. Bronner's liquid soap, travel size\n   * Razor and handle\n   * Deodorant\n   * Face lotion\n   * Beard oil\n   * Q-tips\n   * Toothbrush/toothpaste\n   * Cologne, tiny travel size tube\n   * Packed in ziplock bag\n* Meds Pack\n   * Ibuprofen, melatonin, benadryl, tums, imodium\n* Clothing (packed in several compression cubes)\n   * Patagonia nanopuff\n   * Patagonia minimalist wading jacket for rainy days\n   * Scarf (may cut out because of bulk)\n   * Wool beanie (shaved head = need beanie)\n   * 3 pairs heattech shirt\n   * 3 pairs heattech tights\n   * 3 long sleeve shirts\n   * 2 T shirts (cut out T-shirts and sub in an extra long sleeve?)\n   * House shorts\n   * Tech Chinos (have yet to buy one, will do soon. Potentially will replace jeans and be used as only pair of pants)\n   * 2 pairs socks (wool)\n   * 4 pairs underwear (smartwool/airism)\n* Nice clothing for Rudolfinum concert nights\n   * Coat? Or can I get away with just shirt + tie + v neck. Still want to look smart-ish for the concert dress code.\n   * Collared shirt/polo for concert nights\n   * Wool knit tie\n   * V neck sweater\n   * Dress loafers for concert nights? \n* Electronics/Tech (cables and chargers packed in organization compartment)\n   * Travel power converter\n   * Phone charger with cable\n   * Battery pack with cable\n   * Bose headphones (clipped on side of bag w/ carabiner)\n* On Hand Items/Wear on flight\n   * Passport\n   * Wallet\n   * Phone\n   * Chapstick\n   * Buff\n   * Wool underwear\n   * Wool socks\n   * Jeans\n   * T shirt\n   * Heavy cotton shirt jacket\n   * Leather chucks\n* Timbuk2 bag for EDC? or stick with Setout Daypack?\n\nMy main concern is the stuff for the concert nights, and whether or not I'll be warm enough overall. I generally enjoy the cold weather anyway but due to my bald head I do get the chill a bit quicker. I will have access to a washer and dryer in Amsterdam and Prague so washing won't be an issue. I generally travel wearing chucks but I'm exploring \"barefoot\" style footwear more lately. My last foray into a pair of Vivobarefoot Fulhams weren't quite successful so I'll have to see what I'll try next.",
        "subreddit": "onebag",
        "score": 5,
        "num_comments": 4,
        "created_utc": 1565031345.0,
        "url": "https://www.reddit.com/r/onebag/comments/cmf6xo/2_week_trip_to_amsterdam_and_prague_in_december/"
      },
      {
        "id": "cmek2p",
        "title": "Setout Divide + Messenger Bag",
        "text": "Hear me out... lol\n\nI don't plan on wearing both at the same time. I usually would rather pack my setout daypack inside the setout divide because it takes very little space. My next big trip however is to Amsterdam and Prague, both areas with a high prevalence of pick pockets. I'm less comfortable with a super thin backpack setup as my EDC bag in areas with higher theft risk.\n\nI plan on taking my current EDC bag which is a Timbuktu Flight Messenger bag (size small). It's not huge by any means but it definitely is bulkier than the setout daypack. So rather than packing it in the bag I was trying to think of a way to affix it to the exterior of the setout. Has anybody tried out the Tribe One MiniNet on the setout? \n\nAlternately, any hacks you can think of to make a setup like the setout daypack more secure? Other than wearing it in front of me like some sort of weirdo.... lol.",
        "subreddit": "onebag",
        "score": 2,
        "num_comments": 1,
        "created_utc": 1565028499.0,
        "url": "https://www.reddit.com/r/onebag/comments/cmek2p/setout_divide_messenger_bag/"
      },
      {
        "id": "cizo98",
        "title": "Airport - Love em, hate em, or meh?",
        "text": "How does the onebag community feel about airports?\n\nI'm not what most would consider a frequent flyer. I probably fly between 3 - 6 times a year. 1 or 2 of those are usually international flights. I personally love airports and a lot of my friends don't quite understand it. A part of it is the excitement and realization of a trip that's been planned. Another part is something I can't quite describe. There's just something about it that I love.\n\nSome airports are better than others and I'm lucky to have a pretty decent international airport in my city. I usually get to the airport almost 3 hours before my flight (if international), partially for peace of mind but also so I can just walk around and people watch, maybe grab a drink, read a book, etc...\n\nDoes anybody else identify with this? Or if it just completely off?\n\nAnybody have a favorite airport?",
        "subreddit": "onebag",
        "score": 132,
        "num_comments": 152,
        "created_utc": 1564339770.0,
        "url": "https://www.reddit.com/r/onebag/comments/cizo98/airport_love_em_hate_em_or_meh/"
      },
      {
        "id": "bdt8i3",
        "title": "First Time I've Noticed This",
        "text": "",
        "subreddit": "houston",
        "score": 59,
        "num_comments": 38,
        "created_utc": 1555417003.0,
        "url": "https://imgur.com/Hrt1SG2.jpg"
      },
      {
        "id": "adiu3h",
        "title": "Yeast Pitch Rate Question",
        "text": "So I'm brewing a 3 gallon batch of DIPA style beer with planned OG being 1.073 SG. Mfg recommendation (Omega yeast) is direct pitch for any 5 gallon wort up to 1.060 SG, and to create a starter for anything higher.  \n\nSince I'm running a much lower batch volume will I still need to create a starter? 3 gallons of 1.073 is equivalent to 5 gallons of 1.044 is part of the logic behind my initial thinking.   \n\nBut then I read more about osmotic pressure due to increased sugar content and I guess if that's the main reason to pitch higher then the smaller volume would still need a starter since it's above 1.060? \n\nI'm using Omega Saisonsteins Monster and at the same time if I underpitch it might not be the end of the world if it means just a bit more belgiany ester production?  \n\nThoughts on this? ",
        "subreddit": "Homebrewing",
        "score": 3,
        "num_comments": 5,
        "created_utc": 1546875714.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/adiu3h/yeast_pitch_rate_question/"
      },
      {
        "id": "9on84k",
        "title": "Uniqlo Men's Slim Fit Chino $1.90",
        "text": "Sizes 29 to 31 w/ 34 inseam in Dark Green available as of this posting.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/b8wnnwcrljs11.png?width=334&format=png&auto=webp&s=0b8e5dd4c848940135ee45b0e3fd3473570faeb5\n\n[https://www.uniqlo.com/us/en/men-slim-fit-chino-flat-front-pants-400137.html?dwvar\\_400137\\_color=COL36&cgid=men-sale](https://www.uniqlo.com/us/en/men-slim-fit-chino-flat-front-pants-400137.html?dwvar_400137_color=COL36&cgid=men-sale)",
        "subreddit": "frugalmalefashion",
        "score": 32,
        "num_comments": 14,
        "created_utc": 1539693514.0,
        "url": "https://www.reddit.com/r/frugalmalefashion/comments/9on84k/uniqlo_mens_slim_fit_chino_190/"
      },
      {
        "id": "9gq0fq",
        "title": "Fridge Goofed Up, Keg Froze",
        "text": "So... Something went crazy with my fridge and the compressor basically started working non stop, freezing everything in there. I thought I'd caught it early enough to keep the beer from freezing, but when I tried to pull a pint for dinner a tiny bit came out and then the flow stopped.\n\nThis happen to anybody here before?\n\nSince the fridge is fine now I'm thinking I'll keep it in there to warm up to regular fridge temps for a couple days. Thoughts?\n\nSide note, I'm brewing a fall saison and it went from 1.054 to 1.004 in less than 3 days. So I got that going for me. ",
        "subreddit": "Homebrewing",
        "score": 8,
        "num_comments": 6,
        "created_utc": 1537231208.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/9gq0fq/fridge_goofed_up_keg_froze/"
      },
      {
        "id": "9ee8v1",
        "title": "Unibrau V3 - 17 lbs Grain Bill",
        "text": "I wrote up a whole thing about this but for some reason it was deleted. Here's a TL;DR version.\n\n17 lbs of grain in the Unibrau V3. Needs a bit of help to keep the RIMS return hose out of the grain bed. Unibrau says the max capacity is 20 lbs, I can't really imagine fitting more than an extra pound in there. Maybe if there wasn't a lb each of oats and rye?\n\nAnyway, I also decided to mill the grains twice at the LHBS to see if I could bump up my terrible efficiency. Stuck mash!! Lol. I'll just leave it to sit for an hour and be very patient while draining the wort.\n\nHappy brewing everybody! \nhttps://imgur.com/bxu0LEI.jpg\n\nMy attempt to un stuck the mash. Ha. Didn't work. Ended up stopping the mash at 45 min and spent the next 30 min slowly encouraging the mash to drain. \n https://imgur.com/4DXkexb.jpg",
        "subreddit": "Homebrewing",
        "score": 27,
        "num_comments": 16,
        "created_utc": 1536510346.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/9ee8v1/unibrau_v3_17_lbs_grain_bill/"
      },
      {
        "id": "982a1e",
        "title": "Another Kegging/Carbonation Question",
        "text": "So I kegged my pale ale for the first time (\\~4.5% ABV - Marris Otter w/ Cascade/Centennial/Galaxy) last Friday and followed this process:\n\n\\- Sanitized corney keg/transfer equipment, etc...\n\n\\- Lubed O-rings, dropped in hop basket with 2 oz keg hops, purged O2, connected gas to the liquid line and opened the keg. Fill with a bit more CO2 via the liquid line and start transferring beer into the keg.\n\n\\- Sealed up keg (used pressure to close the keg opening and then latched). Tested for leaks, everything was all clear.\n\n\\- Placed in fridge and set to 30 psi for burst carb. Read a bit more about burst carb on Brulosophy and decided to set it to 40 psi and leave it overnight.\n\n\\- Ended up leaving the keg at 40 psi the fridge for \\~14 hours. So total time so far has been 2 hours on 30 psi + 14 hours on 40 psi. Reduced to serving pressure of 12 psi. Tested it just to see what amount of carbonation was there. It was basically flat, poured with zero head and had a barely perceptible hint of carbonation on the tip of your tongue.\n\n\\- I've been taking tiny samples each day (after clearing the line) just to see how much it progresses, and it still pours with zero head but has a bit more perceptible carbonation on the tongue. Still considerably flat though.\n\nMy questions:\n\n\\- On the flavor of the beer. The aroma is amazing but the flavor has a slight vegetal flavor to it. The hops have not sat for very long but I'm wondering if the hop sedimentation is interfering with the flavor. I've noticed that as it sits the vegetal flavor has reduced which I'm attributing to the fact that the hops (whatever particles got out of the mesh basket) has settled out a bit. Or maybe yeast in suspension? I used Wyeast 1968 which flocculated like crazy. The finished beer looked pretty damn clear in the fermenter, but it's pouring pretty hazy right now. Chill haze? Hop particles? I did not use oats in the mash, was actually shooting for a clearer beer.\n\n\\- On the carbonation. Did I make a mistake in \"calculation\" for the carbonation times? Should I have waited until my beer and keg was ice cold prior to starting the actual burst carbonation?\n\nI have no doubt that time will solve all of these issues (well not sure about the vegetal flavor but it is definitely diminishing with time for now), but I'm just curious so I know what to do differently next time. Oh also, I went ahead and leaned the keg to the gas side to get the hop canister as far from the liquid dip tube as possible. I wonder if that has anything to do with the flavor change.\n\nSo many questions.\n\nThanks!\n\n&#x200B;\n\nUpdate: As expected... just needed time for the carbonation. As for the flavor, it's improved significantly with the funky vegetal flavor dissipating over time. However it's still lingering a tad. I'm starting to wonder if it's a keg hop issue (used Centennial and Galaxy, and maybe Centennial's spice characteristic I'm just not a fan of?). Still not sure, but it's getting better every day. Thanks!",
        "subreddit": "Homebrewing",
        "score": 1,
        "num_comments": 12,
        "created_utc": 1534512671.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/982a1e/another_keggingcarbonation_question/"
      },
      {
        "id": "8usnhp",
        "title": "Anybody Using a Fermentasaurus as a Ferment and Serve Setup?",
        "text": "I did a search on the subreddit but didn't find a whole lot of results of this. \n\nSo my thought is, I can sacrifice one whole side of my actual fridge for the fermentasaurus and stand. I don't need that much space in my fridge anyway as I meal prep weekly and most of my prepped foods are stackable and takes little space.\n\nRight now I'm in between choosing this setup and going with a couple of mini kegs instead. I like this setup mainly because it's an all in one solution with minimal risk of introducing oxygen into the final product. That's not something I've paid much attention to in the past but I'm curious to see how it will change my beer.\n\nAnybody have experience with using the fermentasaurus for this purpose? I'd love to hear your thoughts.            ",
        "subreddit": "Homebrewing",
        "score": 3,
        "num_comments": 11,
        "created_utc": 1530274447.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/8usnhp/anybody_using_a_fermentasaurus_as_a_ferment_and/"
      },
      {
        "id": "8sdetp",
        "title": "Recipe Critique: Dry Hopped Saison",
        "text": "Hi guys, \n\nFinally got to try out the saison we brewed a little over a month ago. My goal was to have a relatively light saison with some nice dry hop aroma that's easy to drink for the summer months. Opted for French Saison yeast as I'm not the biggest fan of too much belgian character in lighter beers.\n\nHere's the recipe I used. I sort of combined a couple of different recipes I saw online and swapped out hops on the fly with whatever was available at the LHBS (not all willy nilly, I tried to match the IBU totals and pick up hops that should lend good flavor to the beer). I've annotated the recipe with our Actual OG/FG numbers. Did all of the fermentation in one vessel and dry hopped 7 days in. Total time in vessel was 2 weeks.\n\nNotes on the beer: \n\n* Beers are bottled into bombers, and sample is poured into a 10 oz tulip. Color is a medium golden hue, bubbly head formation with the pour which dissipates relatively quickly.\n* Dry hop aroma is good, nelson sauvin comes in with a dry almost effervescent aroma and the motueka gives it a very pleasant fruit forward aroma.\n* On yeast choice, I like this one quite a bit. Very light hint of clove with a slightly more prominent bubblegum flavor. It seems more fruit forward as well but I'm not sure how much of that is imparted from the hop selection.\n* It is VERY dry, unexpectedly so. Our OG was low to begin with and at the end of two weeks we were at 1.000 FG. I honestly didn't know that you could ferment that far, is this a recipe flaw or technique issue? I'm not opposed to super dry beers (and it seems the saison is one of the dryest beer styles), but I was shooting for the upper range of the style guideline to balance out the hops a bit more. It seems with how dry it is the bittering hops take over a bit more.\n\nIdeally I'd like to repeat the recipe and come up with something even more fruit forward and maybe take away that dryness just a touch. Thoughts?\n\nHOME BREW RECIPE:\n\nTitle: Summer Saison\n\nBrew Method: BIAB\n\nStyle Name: Saison\n\nBoil Time: 60 min\n\nBatch Size: 5.5 gallons (fermentor volume)\n\nBoil Size: 7.5 gallons\n\nBoil Gravity: 1.041\n\nEfficiency: 70&#37; (brew house)\n\nRecipe STATS:\n\nOriginal Gravity: 1.056 ---- **Actual OG: 1.040**\n\nFinal Gravity: 1.013 ---- **Actual FG: 1.000 (100\\% attenuation? Is that possible?)**\n\nABV (standard): 5.58&#37; ---- **Actual ABV: 5.3\\%**\n\nIBU (tinseth): 33.13\n\nSRM (morey): 5.73\n\nFERMENTABLES:\n\n11.5 lb - Belgian - Pale Ale (100&#37;)\n\nHOPS:\n\n0.5 oz - Sorachi Ace, Type: Pellet, AA: 11.1, Use: Boil for 40 min, IBU: 18.29\n\n0.3 oz - Mosaic, Type: Pellet, AA: 12.5, Use: Boil for 10 min, IBU: 5.1\n\n0.5 oz - Sorachi Ace, Type: Pellet, AA: 11.1, Use: Whirlpool for 0 min at 165 °F, IBU: 3.78\n\n0.7 oz - Mosaic, Type: Pellet, AA: 12.5, Use: Whirlpool for 0 min at 165 °F, IBU: 5.96\n\n1 oz - Nelson Sauvin, Type: Pellet, AA: 12.5, Use: Dry Hop for 7 days\n\n1 oz - Motueka, Type: Pellet, AA: 7, Use: Dry Hop for 7 days\n\nYEAST:\n\nWhite Labs - French Saison Ale Yeast WLP590\n\nStarter: No\n\nForm: Liquid\n\nAttenuation (avg): 76.5&#37;\n\nFlocculation: Medium\n\nOptimum Temp: 69 - 75 F ---- **Actual fermentation temp: \\~70F - 78F**\n\nPitch Rate: 0.35 (M cells / ml / deg P)\n\nThanks for reading!",
        "subreddit": "Homebrewing",
        "score": 3,
        "num_comments": 7,
        "created_utc": 1529449726.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/8sdetp/recipe_critique_dry_hopped_saison/"
      },
      {
        "id": "8oiqbz",
        "title": "Update: Low OG Brewing with Unibrau V3",
        "text": "Original post is here: [https://www.reddit.com/r/Homebrewing/comments/8mr9w8/unibrau\\_v3\\_brewing\\_getting\\_low\\_og/](https://www.reddit.com/r/Homebrewing/comments/8mr9w8/unibrau_v3_brewing_getting_low_og/)\n\nAlright this will be a longer post than the previous one. I'll take you guys through the brewing steps in a bit more detail and please let me know if this is something I fucked up.\n\nA bit of background, my friend and I have brewed about 14 batches of beer. Starting with a regular BIAB setup, then upgraded to a three vessel setup, and now we further \"upgraded\" to an electric BIAB type setup. With our three vessel setup we were able to hit OG/FG fairly easily after the first couple brew days. With our new Unibrau V3 setup it seems that none of our beers are even close to the recipe's OG.\n\nOn to the most recent brew day, brewing a double IPA, a modified Pliney Clone.\n\nRecipe was built using Brewers Friend web app.\n\nGrain bill:\n\n14 lb Two Row\n\n0.75 lb Crystal 60L\n\n11.5 oz Dextrose \\(late addition/flameout\\)\n\nDesigned for a 5.5 gal yield, into the fermentor \\(1.18 gal grain absorption, 1.5 gal boil off, 0.06 gal kettle loss, 0.25 gal hop absorption\\)\n\nWater needed in theory: \\~8.4 gal initial water input needed initially, \\~7.2 gal wort collected pre\\-boil,\n\nExpected pre\\-boil gravity is 1.053, expected OG is 1.075, and expected FG is 1.014\n\nBrew steps:\n\n\\- First hiccup already, our brew vessel won't fit 8.4 gal of water \\+ 14.75 lb of grain. So I used 7 gal of strike water instead, heated to 161F to bring mash temp to 152F. In theory \\(if I used the calculator correctly\\) this should give me 5.8 gal of wort with a 1.066 pre boil gravity \\(assuming 70&#37; eff\\), which I can then dilute with 1.4 gal of water to bring back to 1.053.\n\n\\- Went through the mash without much issue. At first it seemed a bit stuck but I adjusted the RIMS flow rate, and stirred the grain bed a few times and the flow ended up being pretty good. Picked up the basket and could hear it trickle down at a \"good rate\".\n\n\\- At the end of the mash I took a sample of the wort and stuck it in a metal bowl in the freezer to cool ASAP. It measured as 1.060 pre boil gravity, with 5.8 gal of wort vol. Which calculates to to 64&#37; mash efficiency, not too terrible at this point.\n\n\\- Instead of diluting with the planned 1.4 and sacrificing the OG, I adjusted and added 0.8 gal of water to bring it to the original planned 1.053.\n\n\\- Proceeded with 90 min boil and hop additions, added dextrose at flameout along with whirlpool hops. Cooled down through a plate chiller and measured FG \\(\\~5.2 gal in the kettle post boil\\) is 1.062 :\\(. It's quite a ways off of the 1.075 the recipe calculated \\(70&#37; efficiency\\). 1.062 is with the dextrose added in... which is crazy to me.\n\nSide notes:\n\n\\- I was extra anal on volume management this time and everything was pretty much spot on and matched my equipment setup in the recipe builder. I also confirmed that the volume reading on the kettle is accurate.\n\n\\- Double checked temp coming out of RIMS system and it's spot on \\(\\+/\\- 0.5F\\)\n\n\\- Spoke to the homebrew store \\(ordered online this time\\) and requested the grains milled twice for a finer crush and to me it looked a bit finer but I can't be certain. Next brew I'll grab grains myself and make sure the grains are milled twice.\n\n\\- Skipped using rice hulls this time around, mainly because I was already running a 14.75 lb grain bill. Didn't seem to have any issues with a stuck mash.\n\nAll in all, I'm not that surprised at the 65&#37; mash efficiency for now. Could just be the grain crush again. I am pretty surprised at the low FG especially considering the dextrose addition \\(should be \\+ 0.06 from the dextrose I think\\). Anyway, the beer smells amazing either way and I'm pretty sure will come out fantastic. Just annoyed at the little inaccuracies in the process \\(either my recipe building skills is completely crap or process management on brew day is pretty off\\).\n\nIf anybody has a recipe for their Unibrau V3 \\(with exact water measurements\\) that has worked well in the past please let me know. I'd love to give it a run and see if we can match the numbers.\n\nTL;DR Brewed again and still had a pretty low OG although it wasn't too terrible. Better than the last one at least.\n\nEdit:\n\nSo I completely forgot this. When I took the pre\\-boil gravity reading I didn't have a vessel tall enough for the hydrometer. So I used the hydrometer storage tube instead. It read 1.056 which seemed really low, so I used water and sure enough got 0.996. I made a stupid assumption and applied a \\+0.004 correction factor to the pre\\-boil OG! In hindsight the 1.056 is probably closer to correct and the water reading was erroneous because the tube was a little too tight. I don't think there was enough space between the wall of the storage tube and the hydrometer itself to allow for free movement. Stupid mistake.\n\nAnyway, I recalculated the numbers using 1.056 pre\\-boil gravity and it's making a bit more sense. What still doesn't make sense is the fact that the dextrose didn't contribute to the post boil gravity reading at all \\(which is insane\\). \n\nIs it possible that the dextrose just didn't stir in enough? I admit I didn't stir it vigorously because the whole system was cycling through the pump and plate chiller and I made the assumption that the dextrose would get mixed in that way anyway? Fuckin a. I need to get a proper checklist going on for the next brew. Stirring will be on the checklist lol.",
        "subreddit": "Homebrewing",
        "score": 3,
        "num_comments": 4,
        "created_utc": 1528130341.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/8oiqbz/update_low_og_brewing_with_unibrau_v3/"
      },
      {
        "id": "8mr9w8",
        "title": "Unibrau V3 Brewing Getting Low OG",
        "text": "Hi guys, I've lurked around this subreddit a bit but this is my first time posting here.\n\nMy friend and I recently purchased a Unibrau V3 and we've brewed two batches in it so far. The first batch went decent, with OG being slightly lower than expected. The second batch seemed to go smoothly but again OG was way low \\(1.040 rather than 1.056\\).\n\nI double checked my calculations on Brewer's Friend, and also double checked on the \"Wort\" app for Android and it came out with similar numbers.\n\nWe used 11.5 lb of 2 Row, mashed at 150, had 7.5 gal of wort, and about 5.5 gal fermentor volume. Expected pre boil OG with 70&#37; eff is 1.040, and expected post is 1.054. Actual pre boil OG was 1.031 and post was 1.040. SUPER LOW... \n\nOh and we opted for a super thin mash instead of sparging \\(close to 3 qt/lb ratio\\). I know there's arguments about it affecting pH, etc... but it should not affect sugar conversion that adversely \\(plus we used pH5.2\\). \n\nAnybody else having this issue with the Unibrau? I have difficulty believing that the efficiency of this setup is drastically lower than our previous setup \\(standard 3 container all grain setup\\).\n\nAt the moment the main troubleshooting steps I can think of are:\n\n\\- Double check the volume marker on the main kettle \\(maybe marker is showing less than actual?\\)\n\n\\- Double check temp coming out of the RIMS system \\(maybe mash temp was too low?\\)\n\nJust wanted to see if any other Unibrau brewers ran into a similar issue.\n\nThanks!",
        "subreddit": "Homebrewing",
        "score": 2,
        "num_comments": 11,
        "created_utc": 1527524506.0,
        "url": "https://www.reddit.com/r/Homebrewing/comments/8mr9w8/unibrau_v3_brewing_getting_low_og/"
      },
      {
        "id": "7o39sw",
        "title": "2016 Subaru WRX STi - Used Car - I'm Having Slight Respiratory Issues",
        "text": "Hi everybody,\n\nI bought a used 2016 WRX STi which for the most part seems to be in perfect mechanical condition. The mechanics isn't what I'm quite worried about.\n\nHere's the thing, when I drive it I get this issue where it gets a bit harder to breathe. I don't get light headed or have a headache, just the odd breathing issue. Like it's harder for me to take in a full breath. A bit more about the car. I bought the car from a dealership. When I bought it, I knew the previous owner was a smoker because I could smell a very faint odor in the car. However for the most part the car smells like \"new car\" smell... that smell you get in every used car that's been detailed and what not. I didn't notice the issue during the test drive since those last around 10 - 15 minutes usually. And really, when you get in the car you can't smell any kind of \"chemical odor\" whatsoever... just the fragrance smell.\n  \n\nI can only assume that whatever cleaning product the previous owner (or the dealership) used to mask the smoke smell may be overly strong? \n  \n\nFor a while I thought I was just going a bit crazy, but I drove a rental car for the weekend while the car was getting the CPO inspection performed and I felt completely fine in the rental.\n  \n\nOne last tidbit of information... I recently noticed that when I get out of the car and breathe/exhale internally I can smell a very faint ammonia smell. By breathe internally I mean that thing where you pump air from your mouth into your nose... kind of like when you're trying to pick up flavors from wine or food or something.\n  \n\nI'm pretty sure the below things aren't the issue:  \n* I'm not sensitive to smoke smell or cigarette residue as I grew up with smoking parents so I'm pretty sure it's not that.   \n* I don't think it's an issue with a leaky exhaust as I haven't detected any leaks (via sight, sound, and running my hand around the downpipe/midpipe/axleback connection points). And the exhaust is stock, with a catalytic converter n all that.  \n* Read a thread about a mouse/rat's nest in the airbox causing ammonia smell... Longshot but I checked it anyway and that wasn't it.  \n* I already changed the cabin air filter behind the glove box.\n  \n\nI'm at the verge of getting a full professional detail done with steaming out the carpet/headliner and cleaning out the HVAC system... Just wondering if any of you guys might have another clue as to what could be the culprit.",
        "subreddit": "MechanicAdvice",
        "score": 11,
        "num_comments": 26,
        "created_utc": 1515075943.0,
        "url": "https://www.reddit.com/r/MechanicAdvice/comments/7o39sw/2016_subaru_wrx_sti_used_car_im_having_slight/"
      },
      {
        "id": "5fmj3b",
        "title": "Using Strava To Track Daily Walking Mileage?",
        "text": "I'm going on a trip to Vienna soon and setting a goal of walking around the city as much as I can (~10 miles a day is the target). Thinking about attempting to track that with Strava and maybe create a mini heat map of my routes at the end of the trip. \n\nAnybody every try this before? I think it would be pretty neat. I have a massive battery pack and a spare phone that I use for runs (a non fablet sized phone haha), so battery life isn't really too concerning for me.",
        "subreddit": "Strava",
        "score": 8,
        "num_comments": 13,
        "created_utc": 1480467102.0,
        "url": "https://www.reddit.com/r/Strava/comments/5fmj3b/using_strava_to_track_daily_walking_mileage/"
      },
      {
        "id": "4twafv",
        "title": "Dental insurance not covering crowns due to accidental injury",
        "text": "I broke my some teeth a while back at a concert, and got crowns for them at my usual dentist's office. They submitted the claim to my insurance company and the insurance company has come back and denied the claim. They're saying that because I broke my teeth in an accidental injury it should be covered by my medical insurance.\n\nMeanwhile my medical insurance is high deductible so it would pretty much be 100% out of pocket if I did pursue that route.\n\nDoes anybody know if I have any recourse with the dental insurance? \n\nI don't think it makes a difference, but my medical and dental is covered by the same company.",
        "subreddit": "Insurance",
        "score": 1,
        "num_comments": 3,
        "created_utc": 1469095808.0,
        "url": "https://www.reddit.com/r/Insurance/comments/4twafv/dental_insurance_not_covering_crowns_due_to/"
      },
      {
        "id": "418dra",
        "title": "Awesome sunrise today",
        "text": "",
        "subreddit": "houston",
        "score": 80,
        "num_comments": 3,
        "created_utc": 1452950556.0,
        "url": "http://imgur.com/7qNq8Ph"
      }
    ],
    "comments": [
      {
        "id": "n3394nu",
        "text": "Eat Drink Man Woman opening scene",
        "subreddit": "movies",
        "score": 2,
        "created_utc": 1752506485.0,
        "is_submitter": false
      },
      {
        "id": "n3354ss",
        "text": "Now that cruise control is standard on the non SP I would say no it's not worth the $2500 extra cost. \n\nIf you have the extra funds I would definitely go for the SP because why not. Otherwise get the standard model, and upgrade the parts you think you need to upgrade.",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1752505327.0,
        "is_submitter": false
      },
      {
        "id": "n329azh",
        "text": "Incorrect.\n\n[https://www.marlinfirearms.com/s/model\\_1895trapper/](https://www.marlinfirearms.com/s/model_1895trapper/)",
        "subreddit": "gundeals",
        "score": 1,
        "created_utc": 1752494909.0,
        "is_submitter": false
      },
      {
        "id": "n31kae1",
        "text": "Trapper for me personally. 16\" barrel vs 18\" on the SBL.",
        "subreddit": "gundeals",
        "score": 1,
        "created_utc": 1752482175.0,
        "is_submitter": false
      },
      {
        "id": "n2y3abd",
        "text": "shmeeseburgers",
        "subreddit": "food",
        "score": 3,
        "created_utc": 1752433817.0,
        "is_submitter": false
      },
      {
        "id": "n2xyv63",
        "text": "Currently by choice sort of kind of. \n\nMy work/life schedule is a bit nuts, not that I work way too much or anything... more like I spend 3 weeks in city A for my work, then I spend \\~2 weeks in city B. While working in City A my schedule is pretty tight and I value sleep so it's a bit too stressful to date. While staying in City B I'm helping take care of my mom and it's hard to maintain a dating life when you're only in town \\~33% of the year AND your mom is living with you. \n\nCould I try to date? Sure... it would be kind of exhausting to make time for it at the moment though and I don't feel like the investment in time and stress is worth the benefit at the moment.\n\nI'm okay with it, I've been through my hoe phase. Plus I'm not lonely and this isn't a permanent thing... I'll hopefully be back to a normal routine in a couple years.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1752432497.0,
        "is_submitter": false
      },
      {
        "id": "n2wm2uj",
        "text": "A few years back I was on a motorcycle trip and on my way back east, passing into NW Texas somewhere I drove past what I think is a cattle processing plant.\n\nI have a pretty strong stomach and most smells don't make me gag (one exception for actual vomit itself). Driving past this place I had to do everything I could to keep myself from puking inside my helmet. Just thinking about it now is making my stomach contract uncomfortably.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1752417969.0,
        "is_submitter": false
      },
      {
        "id": "n2vllu6",
        "text": "I popped in here to say Journey as well. Playing coop with someone else, with no method of communication other than light and sound pulses was so cool. You could tell who wasn't into it because sometimes the other player would just drop out, but when you get someone that gets into it, it's like you discover a whole other language kind of.\n\n  \nI have very fond memories of that game.",
        "subreddit": "gaming",
        "score": 2,
        "created_utc": 1752403385.0,
        "is_submitter": false
      },
      {
        "id": "n2ptpgj",
        "text": "Why was this hilarious/terrifying photo of the coneloaf removed by mods? I feel like it's kind of in keeping with the antics of Conan in general.",
        "subreddit": "conan",
        "score": 1,
        "created_utc": 1752322990.0,
        "is_submitter": false
      },
      {
        "id": "n2kegyc",
        "text": "I work down the road and we used to order this every month or so. The quality control varies wildly unfortunately... sometimes the interior is dry AF sometimes it's pretty good. Whatever you get though the glazed exterior is always pretty damn good.",
        "subreddit": "houston",
        "score": 1,
        "created_utc": 1752248115.0,
        "is_submitter": false
      },
      {
        "id": "n2ke2qt",
        "text": "Wouldn't say low price point, but they do serve massive portions and I would consider it bang for your buck. Last time I got their grilled chicken sandwich w/ fries it cost me $18, but to be fair they use a WHOLE chicken breast, not a split one and the include an obscene amount of fries. If it came with an extra set of buns you could literally make two chicken sandwiches out of it.",
        "subreddit": "houston",
        "score": 3,
        "created_utc": 1752248005.0,
        "is_submitter": false
      },
      {
        "id": "n2etggq",
        "text": "I am the capital of Laos. At least I have a cool name I guess.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1752172781.0,
        "is_submitter": false
      },
      {
        "id": "n2e9zn3",
        "text": "An episode of Everwood.\n\n  \nI'm a 43 year old man.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1752167447.0,
        "is_submitter": false
      },
      {
        "id": "n2e9kva",
        "text": "aww it's a husky and a lil wookie hahah",
        "subreddit": "funny",
        "score": 1,
        "created_utc": 1752167337.0,
        "is_submitter": false
      },
      {
        "id": "n26sbrl",
        "text": "Surprised nobody's mentioned the Contemporary Art Museum. It's indoors, free, and has a couple of pretty neat features when I went. Camera at the entrance that projects your image onto the wall with a neat delayed effect, and the tunnel that connects you to the art school is lit with a cool sepia kind of light that kind of makes your eyes see everything in black and white. \n\nKuhl Linscomb is one someone recommended on here. It is a great store with a lot of cool (but mostly kind of pricey) stuff. So just beware if you go.\n\nPhoenicia is cool but unless you're buying food there for lunch I'd say skip it. Mainly because I'd be pretty sad if I had to walk past all of the food options and not eat anything.",
        "subreddit": "houston",
        "score": 0,
        "created_utc": 1752073763.0,
        "is_submitter": false
      },
      {
        "id": "n21bn3j",
        "text": "Disclaimer these are not my words I'm just trying to paraphrase OP  \n  \nTL;DR - Yea Sade Perkins said shitty things but she's not wrong about white people being racist. Stop being racist.\n\n  \nAnother disclaimer I didn't really read the whole thing I basically read every other sentence but I'm pretty sure it's kind of right.",
        "subreddit": "houston",
        "score": 3,
        "created_utc": 1752001177.0,
        "is_submitter": false
      },
      {
        "id": "n1zm43v",
        "text": "Squeezed about 4000 miles out of the rears on mine. Swapped to a set of Dunlop Roadsmart IV and that lasted 10k easily. Swapped to Dunlop Mutants which had a similarly longish life on the rear tires. The fronts lasted about an 5k miles.\n\nJust had a new set of Roadsmart IV installed last month.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1751984004.0,
        "is_submitter": false
      },
      {
        "id": "n1qy71g",
        "text": "that's fair, just figured I'd ask. Thanks.",
        "subreddit": "gundeals",
        "score": 2,
        "created_utc": 1751858715.0,
        "is_submitter": false
      },
      {
        "id": "n1qx3nu",
        "text": "What's the pricing on the Marlin 1895? Is it priced as marked on the site?",
        "subreddit": "gundeals",
        "score": 1,
        "created_utc": 1751858261.0,
        "is_submitter": false
      },
      {
        "id": "n1q1bbb",
        "text": "2022 MT09, 40k+ miles, \\~1000 miles of gravel/dirt forest trails with \\~20% of that being washboards, Hepco Becker engine guards installed at \\~13000 miles, dropped once on left side (just a near zero mph tipover).\n\n  \nNo cracks thus far.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1751846279.0,
        "is_submitter": false
      },
      {
        "id": "n1q0dac",
        "text": "Hell yeah another touring MT09!",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1751845939.0,
        "is_submitter": false
      },
      {
        "id": "n1pzxlv",
        "text": "I did mine a few weeks ago and found that I needed to bleed the master cylinder last to get a couple of bubbles out. Another thing is to try and zip tie the front lever overnight, old trick... sometimes helps sometimes doesn't but you have nothing to lose.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1751845784.0,
        "is_submitter": false
      },
      {
        "id": "my4rgjk",
        "text": "Depends on what you're looking for.\n\n765 RS  - a super sporty scalpel of a bike\n\nMT09 - not super precise but monster torque and hell of a hooligan bike, especially the 2018 version with less \"refined\" geometry and suspension.",
        "subreddit": "motorcycles",
        "score": 2,
        "created_utc": 1750101163.0,
        "is_submitter": false
      },
      {
        "id": "my4ny8m",
        "text": "Zack Courts is pretty tall at 6'2\" and does a pretty good job of testing out a bike and giving us his thoughts. Check out the video if you haven't.\n\n  \n[https://www.youtube.com/watch?v=nJSG9NMyELo](https://www.youtube.com/watch?v=nJSG9NMyELo)",
        "subreddit": "MT09",
        "score": 3,
        "created_utc": 1750100161.0,
        "is_submitter": false
      },
      {
        "id": "my2pbpc",
        "text": "My understanding is, It's possible to have a cylinder misfire at idle but fire more reliably with more throttle.\n\nUnless it's purely an artifact of the phone recording, that idle does not sound right. The clicking sounds and what not are normal, though what I'm hearing more than anything is the idle going thupathupathupathupathupa rather than the standard BRRRRRRRRRRRRRRR\n\n  \nif that makes sense lol\n\n  \nYou could test this by cold starting the bike and not revving it at all, leaving it at idle and measuring the temp of each cylinder as it idles.",
        "subreddit": "MT09",
        "score": 3,
        "created_utc": 1750079494.0,
        "is_submitter": false
      },
      {
        "id": "my2kckf",
        "text": "That idle definitely sounds a bit funky, like someone else has said it sounds like not all cylinders are firing.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1750077690.0,
        "is_submitter": false
      },
      {
        "id": "mxwv7rf",
        "text": "I've had good luck with Arivex, not actually far from SW Alignment when I googled it. I took my WRX and STI there about a half dozen times.",
        "subreddit": "houston",
        "score": 1,
        "created_utc": 1749997254.0,
        "is_submitter": false
      },
      {
        "id": "mxqwgx4",
        "text": "It's a pretty common romcom trope. Boy meets girl, they fall for each other, something happens to break them apart, they come together in the end and happily ever after.\n\n* She's Out of My League\n* Friends with Benefits\n* Forgetting Sarah Marshall (one of my all time faves)\n* Always be My Maybe\n* Crazy Stupid Love\n* 50 First Dates\n* He's Just Not that Into You\n* Notting Hill\n* Bridget Jones Diary\n\nThere are so many more of these movies and some are better than others. I'd say just search for romcom on your favorite streaming platform and see what you get.",
        "subreddit": "movies",
        "score": 1,
        "created_utc": 1749911786.0,
        "is_submitter": false
      },
      {
        "id": "mxlvho8",
        "text": "Happy until I'm sleepy",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1749839069.0,
        "is_submitter": false
      },
      {
        "id": "mxkvh15",
        "text": "I mean the rate is listed in his post so that's a given.\n\nHis bill, based on his usage and kwh rate is not abnormally high.",
        "subreddit": "houston",
        "score": 14,
        "created_utc": 1749828879.0,
        "is_submitter": false
      },
      {
        "id": "mxkro0a",
        "text": "For a 4 bedroom house with mediocre insulation and his use case, it's not that high.",
        "subreddit": "houston",
        "score": 32,
        "created_utc": 1749827810.0,
        "is_submitter": false
      },
      {
        "id": "mxkjpfh",
        "text": "Your bill seems perfectly normal for the size of house and electricity usage. \n\n78F when nobody is home\n\n74 - 75F when you get home (or set it to drop to 75F by the time you get home)\n\n70 - 72F for sleep temp. Use the ceiling fan to keep a cool breeze effect and ditch the thick blanket/comforter and use a thinner blanket.",
        "subreddit": "houston",
        "score": 61,
        "created_utc": 1749825550.0,
        "is_submitter": false
      },
      {
        "id": "mxj8nll",
        "text": "Not a good idea. \n\nScooter = low power, twist throttle and go, much lower risk (and consequences) for people with limited skill\n\nMT09 = high power, significantly more complex operation, significantly higher risk and chance of injury\n\nCan you do it, and will you be fine? Maybe, who knows. But statistically you will be much more likely to injure yourself by taking this big leap.",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1749806953.0,
        "is_submitter": false
      },
      {
        "id": "mxckbxh",
        "text": "The things I almost always buy when I stop in.\n\n\\- Big jar of Lao Gan Ma Chili Crisp. Best price for it, usually around $8\n\n\\- Kecap Manis (Indonesian sweet soy sauce). You'll find it in the soy sauce aisle. Thick, salty sweet, great to just put a bit on rice or to sweeten up your stir fry sauce a bit. Google it just so you know what it looks like before you go maybe since it'll be in between 30 other different bottles lol.\n\n\\- Kecap ABC hot sauce. Indonesian hot sauce, several flavors. Think sriracha but slightly different. Some skew sweet, and some savory. The garlic one is a pretty good one.\n\n\\- Squid jerky. Spicy, sweet, savory, addictive.\n\n\\- Frozen dumplings, hard to go wrong with these. Lasts forever in the freezer and comes in clutch to bulk up your ramen.\n\n\\- Chinese dried plums - [Li Hing Mui](https://en.wikipedia.org/wiki/Li_hing_mui). An advanced snack for those who didn't grow up with it but it is incredible. It's predominantly sour, then sweet with a touch of salt. Different brands will vary in sweet/salt levels. The ones at 99 comes in little square plastic jars. \n\n\\- Chinese dried orange peel. You'll find it in the same section as the dried plums. This one is more approachable to people I think. These come in little cylindrical plastic jars.\n\n\\- Butter cookies. Cheap and delicious. A great thing to buy to share with people at work.",
        "subreddit": "houston",
        "score": 2,
        "created_utc": 1749717862.0,
        "is_submitter": false
      },
      {
        "id": "mx6puv4",
        "text": "\"In the news today, a man was arrested for eating cereal\"\n\n  \n\"Oh we forgot to mention that he broke into someone's home and stole cereal\"",
        "subreddit": "houston",
        "score": 3,
        "created_utc": 1749643680.0,
        "is_submitter": false
      },
      {
        "id": "mx6hcmc",
        "text": "This is what I keep hearing people spout out. There are \"plenty\" of social media posts about it but nobody ever actually quotes specific posts that are confirmed issues.\n\nI've seen a quite a few of \"is there a frame issue?\" / \"fragile frame??\" / \"do I need to worry?\" / \"there's a mark on my frame is this a crack?\" posts but can only recall 2 maybe 3 actual posts where someone has an actual issue. Out of how many MT09s in the world... 100000+?\n\nSo yeah, at the moment there's not enough evidence out there to support the idea of \"oh no your MT09 is fragile and you should beware.\" \n\nI'd gladly change my mind if the data supports it, but at this point it does not.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1749640045.0,
        "is_submitter": false
      },
      {
        "id": "mx6ezrh",
        "text": "Did you click on any of those links and read the content? Most of them are people asking about cracked frames due to \"seeing posts\" but nobody quotes actual information. The \"2021 MT09-SP Chassis Broken | Page 3\" post on [fz09.org](http://fz09.org) isn't even referencing the same issue, the dude flew off the road and his frame cracked. Color me surprised.\n\nAside from one youtube clip there are no other actual issues that even match your situation. So 2 out of a couple hundred thousand MT09s have developed a cracked frame with little other information. Still pretty skeptical.",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1749638934.0,
        "is_submitter": false
      },
      {
        "id": "mx6c8wu",
        "text": "Lol gave me a chuckle.",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1749637522.0,
        "is_submitter": false
      },
      {
        "id": "mx29ais",
        "text": "Not claiming it's trivial, simply that there's not enough evidence linking cracked frames with a manufacturing defect by this post alone. \n\nBasically the information we have is, some guy that loves wheelies and has a frame slider installed cracked his frame. Well shit... could be he's shitty at wheelies. Could be he installed the frame slider incorrectly. Could be a combination of both. \n\nI have 30k+ on my MT09 (3rd gen), ride through gravel tracks on my tours quite regularly, and in general don't treat my bike gently (though admittedly I don't pull crazy wheelies). No issues here. Additionally if this was such a huge and prevalent issue (like the TPS sensor issue) then there would be at the very least weekly to monthly posts on the [fz09.org](http://fz09.org) forum about it, yet there is not. \n\nSo yeah I'm skeptical.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1749580273.0,
        "is_submitter": false
      },
      {
        "id": "mx24y4h",
        "text": "Beware one cracked frame reported by a random person on the internet\n\nYamaha better recall all bikes now otherwise they'll never have my business again /s",
        "subreddit": "MT09",
        "score": -10,
        "created_utc": 1749579052.0,
        "is_submitter": false
      },
      {
        "id": "mx22juu",
        "text": "Ah gotcha, I missed the special color part. Was just shocked to see a Zion fetch $1k+ MSRP while scrolling. Further scrolling shows some deals to be had, almost got me with that Raging Hunter lol.",
        "subreddit": "gundeals",
        "score": 2,
        "created_utc": 1749578388.0,
        "is_submitter": false
      },
      {
        "id": "mx1yh97",
        "text": "I was wondering about that when I saw the IWI Zion15 at \\~1230 when it's \\~800 bucks most places",
        "subreddit": "gundeals",
        "score": 3,
        "created_utc": 1749577283.0,
        "is_submitter": false
      },
      {
        "id": "mwv8uoy",
        "text": "Google any movie by Stephen Chow.\n\n  \nGod of Cookery is a great one. The silliness levels will only increase from Kungfu Hustle fyi... KH is silly but not nearly as silly as the usual Stephen Chow production films.",
        "subreddit": "movies",
        "score": 16,
        "created_utc": 1749490744.0,
        "is_submitter": false
      },
      {
        "id": "mwbqj8e",
        "text": "There's a bakery in a small town in Colorado that does the same thing on certain days of the week. When you visit their location you visit the whole factory so to speak. Walk into the front door and there's a casual cafeteria area with breads for purchase, pastries, etc... Prices are listed and it's 100% honor system when I went. It was a really cool spot and their baked goods were incredible to boot. You can also buy their flour which I thought was super cool.\n\nMountain Oven Bakery & Millhouse in Paonia, CO, go visit them if you're passing through. Absolutely incredible stuff.",
        "subreddit": "videos",
        "score": 2,
        "created_utc": 1749221450.0,
        "is_submitter": false
      },
      {
        "id": "mvz3oqj",
        "text": "I would say not generally. The descriptor jammy generally means a wine that is full of fruit notes, thing strawberries or blackberries, that might bring along some perceived sweetness but doesn't straight up taste like sugar.\n\nI'm not familiar with Jammy Red Roo but I did google it and it shows that it does have a significant amount of residual sugar at 35 g/L. My understanding (I could be wrong) is that residual sugar is usually a product of controlled fermentation, not going to full dryness.",
        "subreddit": "Homebrewing",
        "score": 8,
        "created_utc": 1749053746.0,
        "is_submitter": false
      },
      {
        "id": "mvt35dd",
        "text": "I rate myself as good. Not incredible but generally above average.\n\nThe best way I can describe it is, I have cooked enough and am aware of how to use most ingredients to where if you present me with a set of ingredients with no recipe or instructions I could make a meal out of it with the following results:\n\n\\- 60% chance it will be good and tasty, as in I would pay for it at a restaurant.\n\n\\- 15% chance it will be downright amazing stuff, better than I can get compared to most restaurants.\n\n\\- 20% chance it would be pretty good but probably not something I'd pay for at a restaurant.\n\n\\- 5% chance I fuck something up and I might still eat a portion of it but won't touch the leftovers. This happened most recently when I was making salted cod stew, spaced out, and burned the bottom.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1748972424.0,
        "is_submitter": false
      },
      {
        "id": "mvqxs9a",
        "text": "Pic for reference\n\nhttps://preview.redd.it/qqgv5lh50p4f1.png?width=935&format=png&auto=webp&s=4fe1b2e80c42aa5510ac42d97da6cba0ab3d425a",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1748947940.0,
        "is_submitter": false
      },
      {
        "id": "mvqxewl",
        "text": "Before you change anything... how does it ride? Because if it rides well then leave it alone.\n\n  \nThat pretty similar to how my bike suspension geometry is set up. Gets rid of the front end wobbles under heavy acceleration for the most part.",
        "subreddit": "MT09",
        "score": 1,
        "created_utc": 1748947760.0,
        "is_submitter": false
      },
      {
        "id": "mvqwqsw",
        "text": "Lithium batteries have been pretty proven in motorsports imho, been around for 20 years and only getting better. I swapped my MT's battery for a budget version (NOCO NLP14) 2 years ago for $125. \n\n  \nThe OEM battery when not connected to a trickle charger would struggle on colder mornings. The lithium battery has literally never been connected to a trickle charger and it has never even sounded like it struggled to start. I've left my bike in freezing temp weather for weeks and come back to it starting completely fine. \n\n  \nJust to add to this, the lithium battery in motorsports are usually LiFePo4 these days which have incredible thermal stability and is in no way comparable to a standard Li-ion battery you'd see in cell phones.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1748947437.0,
        "is_submitter": false
      },
      {
        "id": "mv3l2sl",
        "text": "[https://www.fz09.org/threads/mt09-generations.73873/?post\\_id=969267#post-969267](https://www.fz09.org/threads/mt09-generations.73873/?post_id=969267#post-969267)",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1748624612.0,
        "is_submitter": false
      },
      {
        "id": "muqrsed",
        "text": "well that's certainly enough miles...\n\nEscalate to Yamaha corporate is an option. Won't be a quick affair though. Could attempt to balance your throttle bodies and see if that improves things.",
        "subreddit": "MT09",
        "score": 4,
        "created_utc": 1748456676.0,
        "is_submitter": false
      },
      {
        "id": "muqnh4c",
        "text": "How many miles have you ridden since the recall was performed?\n\nThe ECU needs to re-learn some things basically is the general consensus on the FZ09 forum. Most of the people that report funky shit upon picking up their bike has had it resolved after riding it a bit.",
        "subreddit": "MT09",
        "score": 5,
        "created_utc": 1748455451.0,
        "is_submitter": false
      },
      {
        "id": "muql3ab",
        "text": "This. Everything at Roostar is just incredibly sweet to my palate. Their condiments taste like they amp the sugar up 100%. Not a bad place, just leans too much on the sugar to westernize the palate imo.",
        "subreddit": "houston",
        "score": 6,
        "created_utc": 1748454787.0,
        "is_submitter": false
      },
      {
        "id": "mukjsmy",
        "text": "Nope. Was just gonna keep rockin with it until I hit a couple thousand rounds to see if breaking it in helps. If that doesn't work I'll start looking for things to sand down.",
        "subreddit": "GrandPowerStribog",
        "score": 2,
        "created_utc": 1748374285.0,
        "is_submitter": false
      },
      {
        "id": "mujyrag",
        "text": "Ran a few hundred PMC 147gr subs recently with no issues. Had the HUXWRX Rad45 mounted.",
        "subreddit": "GrandPowerStribog",
        "score": 2,
        "created_utc": 1748368317.0,
        "is_submitter": false
      },
      {
        "id": "mujy5dz",
        "text": "Same problem on my brand mini bog. Took me a bit to realize that it was only happening when the bolt is open tho.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1748368153.0,
        "is_submitter": false
      },
      {
        "id": "mujvtb8",
        "text": "If you're really that hard up for the cash then just go with the cheapest one you can get and see if you can live with it. Buy a slightly nicer one for your next bottle if you hated it.\n\n  \nNot a judgment but maybe talk to someone also... 9 handles of tequila a month is A LOT even split between two people. I have a lot of friends in the service industry and have lost a dear friend to habitual over-consumption. Best of luck to you.",
        "subreddit": "tequila",
        "score": 2,
        "created_utc": 1748367516.0,
        "is_submitter": false
      },
      {
        "id": "muir9nj",
        "text": "Life Itself dang near destroyed me.\n\n  \nAlso not a movie but the Eulogy episode from the most recent Black Mirror season destroyed me.",
        "subreddit": "movies",
        "score": 1,
        "created_utc": 1748355965.0,
        "is_submitter": false
      },
      {
        "id": "msuz2gx",
        "text": "Yeah, my hope is that with some repeated use the action of inserting the mags will do the job. If it doesn't sort itself out by \\~1000 rounds I'll go on sanding.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1747518616.0,
        "is_submitter": true
      },
      {
        "id": "msskhkz",
        "text": "Yep, like it a lot. 30k+ miles on it now and no regrets.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1747489939.0,
        "is_submitter": false
      },
      {
        "id": "mspalyj",
        "text": "I have the Ktech Razor installed on mine. Not sure about pricing now but at $750 a couple years ago (part cost only) it was a decent price. The stock shock is pretty much useless for anyone over 160 lbs and is hot garbage imo.",
        "subreddit": "MT09",
        "score": 4,
        "created_utc": 1747433713.0,
        "is_submitter": false
      },
      {
        "id": "mqtmb5x",
        "text": "I am not unfortunately, but I transit between VA and TX every 3 weeks and try to swing by there every few trips. Bayou Teche is cool with boondockers so it's great for traveling through in my small van.",
        "subreddit": "IAmA",
        "score": 3,
        "created_utc": 1746499898.0,
        "is_submitter": false
      },
      {
        "id": "mqtfstc",
        "text": "I'd say pop by Bayou Teche brewing in Arnaudville, they have good beer and the real reason I super love it is the pizza (Cajun Saucer). Last time I came by they had a raclette pizza it was glorious. Would love to buy the crew a few rounds of beer if I run into y'all!",
        "subreddit": "IAmA",
        "score": 3,
        "created_utc": 1746497528.0,
        "is_submitter": false
      },
      {
        "id": "mqtacm1",
        "text": "Ah shame you'll be south of Arnaudville by then, there's some epic pizzas down at Bayou Teche Brewing. \n\nWould love some details on the pop up exhibition once that's nailed down.",
        "subreddit": "IAmA",
        "score": 1,
        "created_utc": 1746495648.0,
        "is_submitter": false
      },
      {
        "id": "mqnskbz",
        "text": "Shit yeah.\n\nI mainly work night shifts. On my time off I stay up later and wake up by around 1 or 2 pm. Full closet of high end SPF clothing including gloves, complete facial covering. Get a few medical specialists to diagnose me with extreme sensitivity to sunlight / Xeroderma Pigmentosum and might get disability benefits as well.",
        "subreddit": "AskReddit",
        "score": 1,
        "created_utc": 1746422292.0,
        "is_submitter": false
      },
      {
        "id": "mqn8ave",
        "text": "Still got my eye on that trapper, but definitely not in the budget at the moment. \n\nBuy with confidence folks, Dan here is a solid dealer and got my order delivered super quick recently.",
        "subreddit": "gundeals",
        "score": 7,
        "created_utc": 1746413145.0,
        "is_submitter": false
      },
      {
        "id": "mql9obp",
        "text": "Ah okay, the 30 round mags I have are GP mags, just black. Something about them running low on the translucent polymer blend or something like that.\n\n\nHow about your 30 round mags? Gloss? Just curious. Because I might wet sand a portion of my black mags to get the matte surface to have more of a slippery gloss finish and see if that helps.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746388736.0,
        "is_submitter": true
      },
      {
        "id": "mqkq5a9",
        "text": "You mean Global Ordnance I assume. \n\n\nQuestion though, your translucent mags, do they have a smooth gloss like finish?",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746382603.0,
        "is_submitter": true
      },
      {
        "id": "mqkkua7",
        "text": "These won't drop free even when empty once fired.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746380992.0,
        "is_submitter": true
      },
      {
        "id": "mqgu6p7",
        "text": "I won't pretend to be an electrical guru here... the fact that it attempts to start at all points to it likely not being a fuse issue. If the main fuse is blown you won't have power to the starter motor at all. Soooooo after that point I have no idea... starter relay issue from reversing battery polarity? Can that happen? I have no idea... If you can read electrical diagrams here's the circuit for the starting system on the 3rd gen MT09\n\nhttps://preview.redd.it/d1j4vl055oye1.png?width=683&format=png&auto=webp&s=0d12e718b01dc3e4f59a5ddbe7bc780de295f533",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1746322429.0,
        "is_submitter": false
      },
      {
        "id": "mqbqyrk",
        "text": "If it doesn't sort itself out by 1000 rounds I will likely eventually go that way. Might give the magwell a little wipe with a dry teflon lubricant too.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746249736.0,
        "is_submitter": true
      },
      {
        "id": "mqb6pyu",
        "text": "Yeah my mags are definitely not the GO mags, didn't mean to imply that.\n\nThey aren't dropping free as in pressing the mag release does nothing. The mag doesn't budge unless I press the mag release while simultaneously pulling on the mag.",
        "subreddit": "GrandPowerStribog",
        "score": 2,
        "created_utc": 1746240387.0,
        "is_submitter": true
      },
      {
        "id": "mqamucf",
        "text": "oh balls... I thought the US made black mags were a \"better\" version for some reason. Bummer.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746232873.0,
        "is_submitter": true
      },
      {
        "id": "mpyha2r",
        "text": "That's a pretty good looking setup. Getting tommy gun vibes.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1746068491.0,
        "is_submitter": false
      },
      {
        "id": "mpxqm4m",
        "text": "Some find it worth it and others not. It really depends on how you ride and how much you ride. \n\nThe way I see it, the more you ride and the harder you ride, the less an extended warranty is worth it. Theory being, you'll break whatever is going to break before the manufacturer's warranty runs out. \n\nAnything outside of that is normal wear and tear and won't be covered by an extended warranty anyway.",
        "subreddit": "MT09",
        "score": 3,
        "created_utc": 1746059062.0,
        "is_submitter": false
      },
      {
        "id": "mpxf1ng",
        "text": "That's neat. The lighting almost makes it look like pixel art",
        "subreddit": "EarthPorn",
        "score": 3,
        "created_utc": 1746055134.0,
        "is_submitter": false
      },
      {
        "id": "mpqq39e",
        "text": "I think that looks pretty sweet. Probably won't do it to mine just because I prefer a more subdued look, but I do want to black out the hideous Stribog font one of these days. That being said I literally just picked my SP9A3s from the FFL today so it'll be a bit further down the road before I even look into that.",
        "subreddit": "GrandPowerStribog",
        "score": 1,
        "created_utc": 1745966163.0,
        "is_submitter": false
      },
      {
        "id": "mpm8bd8",
        "text": "It's a penis shaped syringe for shots... named Peni Colada which is an obvious play on words for Pina Colada, and the most popular color is flesh which makes it look even more like a penis.",
        "subreddit": "funny",
        "score": 6,
        "created_utc": 1745907513.0,
        "is_submitter": false
      },
      {
        "id": "mpm4ene",
        "text": "DANG... I thought I was replying to OP this whole time. I need to go to bed probably.",
        "subreddit": "movies",
        "score": 2,
        "created_utc": 1745905350.0,
        "is_submitter": false
      },
      {
        "id": "mpm49e6",
        "text": "On Netflix, I really enjoyed Anna Kendrick's new movie Woman of The Hour. Sicario crosses over into action a bit but is really a solid gripping psychological thriller.",
        "subreddit": "movies",
        "score": 2,
        "created_utc": 1745905271.0,
        "is_submitter": false
      },
      {
        "id": "mpm3q2r",
        "text": "oh shit I missed the most important part my bad... I read your description and it pointed me to my favorite of the genre.",
        "subreddit": "movies",
        "score": 2,
        "created_utc": 1745904987.0,
        "is_submitter": false
      },
      {
        "id": "mpm2w8b",
        "text": "Gone Girl",
        "subreddit": "movies",
        "score": 1,
        "created_utc": 1745904559.0,
        "is_submitter": false
      },
      {
        "id": "mpkyv4l",
        "text": "oh yeah my bad, that's normal\n\nhttps://preview.redd.it/o5seh1ueboxe1.png?width=240&format=png&auto=webp&s=6dc70907f4ce7ab537e6746d1480d489d8f3d811\n\nDo you have the owners manual?",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1745888697.0,
        "is_submitter": false
      },
      {
        "id": "mpkvk60",
        "text": "Dark is pretty ambiguous. If it's a brand new bike don't worry about it. Change the oil at 600 miles.\n\nGenerally, color is not a good way to gauge oil health.",
        "subreddit": "MT09",
        "score": 3,
        "created_utc": 1745887535.0,
        "is_submitter": false
      },
      {
        "id": "mpktv1n",
        "text": "Triangle = ABS sensor. Is on when you start the bike but will turn off when you start rolling and the sensor detects wheel movement correctly.\n\nJerkiness likely just the bike as is. The TPS issue doesn't really affect the bike under 3k RPM, these bikes are known to have pretty twitchy throttle responses at lower RPMs. Don't expect the TPS recall to fix that for you. Getting a tune after the recall is done should smooth it out a bit, but still isn't the smoothest bike to ride at low speeds.\n\nThe CP3 motor is NOISY. Get used to the sounds is my only advice.",
        "subreddit": "MT09",
        "score": 4,
        "created_utc": 1745886939.0,
        "is_submitter": false
      },
      {
        "id": "mpkt8qm",
        "text": "that is a DAMN good price for that bottle, pretty sure it was selling direct from the Montagave site for $75 upon release\n\nI really enjoyed mine. Good agave expression with some fruit tones. I would buy at least one or two at $40",
        "subreddit": "tequila",
        "score": 9,
        "created_utc": 1745886722.0,
        "is_submitter": false
      },
      {
        "id": "mpkc8uu",
        "text": "Posted a reply to my initial post.",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1745880855.0,
        "is_submitter": false
      },
      {
        "id": "mpkbsdu",
        "text": "Shad makes a hardcase system. The mounting system called 3P will cost \\~$240 and the bags themselves about $160 on amazon for the SH23 (23L each).\n\nSW Motech has soft bag options. The Cargobag is a 50L bag that can strap securely on the back of your bike. Space is a bit tight on the MT09 with our slightly shorter tail, but it is doable. [https://sw-motech.us/p/4052572198193](https://sw-motech.us/p/4052572198193)\n\nThe same bag above is for sale on the ADVRider forum for $145 by a member. [https://advrider.com/f/threads/bags-connection-sw-motech-cargobag-50l-tail-bag.1791595/](https://advrider.com/f/threads/bags-connection-sw-motech-cargobag-50l-tail-bag.1791595/)\n\nOther option, cheapest and waterproof at \\~$103, is to get a Nelson Rigg dry duffel and strap it on your tail. [https://www.amazon.com/Nelson-Rigg-Hurricane-Duffle-Black-Gray/dp/B09SVJXVL8?th=1](https://www.amazon.com/Nelson-Rigg-Hurricane-Duffle-Black-Gray/dp/B09SVJXVL8?th=1)\n\nThere are other cheaper duffel option but the Nelson Rigg is fit for purpose and comes with really handy cam buckle attachment points.",
        "subreddit": "MT09",
        "score": 3,
        "created_utc": 1745880700.0,
        "is_submitter": false
      },
      {
        "id": "mpk9omo",
        "text": "There are tons of options, all depends on your budget. How much can you afford?",
        "subreddit": "MT09",
        "score": 2,
        "created_utc": 1745879984.0,
        "is_submitter": false
      },
      {
        "id": "mpk530h",
        "text": "If you don't get an answer here, try [https://fordtransitconnectforum.com/](https://fordtransitconnectforum.com/)\n\nThere's a handful of members over there that are super knowledgeable about the platform.",
        "subreddit": "FordTransitConnect",
        "score": 2,
        "created_utc": 1745878412.0,
        "is_submitter": false
      },
      {
        "id": "mpk2h73",
        "text": "Yup\n\nhttps://preview.redd.it/lamujrk9enxe1.png?width=1425&format=png&auto=webp&s=9c1835867dded9f040a9b40977cc03bef9f05a18",
        "subreddit": "houston",
        "score": 9,
        "created_utc": 1745877536.0,
        "is_submitter": false
      },
      {
        "id": "mpjxxio",
        "text": "$80.09 for 4 shipped to TX",
        "subreddit": "gundeals",
        "score": 3,
        "created_utc": 1745875980.0,
        "is_submitter": false
      },
      {
        "id": "mpe3oj0",
        "text": "I think it would be pretty hard to source in town. Amazon has a bunch of options. If you're set on not using delivery you could use a linen tea towel in place, or make your own using linen cloth I suppose?",
        "subreddit": "houston",
        "score": 1,
        "created_utc": 1745794004.0,
        "is_submitter": false
      },
      {
        "id": "mpdd74v",
        "text": "The same people who go, \"I'm not tipping XX amount when all you did is pour liquid out of a bottle\" are the same people that will tell the bartender, \"come on man, hook me up... I'll get you later\"\n\nGet fucked.\n\n\n\nEdit:\n\nTo answer the question, at least in the US, you should tip based on the amount that you purchase. If you can afford to buy a $40 shot you can probably afford to tip $7-8 on that shot.",
        "subreddit": "tequila",
        "score": -3,
        "created_utc": 1745785533.0,
        "is_submitter": false
      },
      {
        "id": "mp9w7li",
        "text": "In reality it's however much people are willing to pay lol. I would go to Cycle Trader, punch in your zip code and see what similar bikes are selling for. Check craigslist too and maybe google some HD forums to get some more insight. KBB for that bike is just about $3k for private sale in good condition but take that with a grain of salt.",
        "subreddit": "personalfinance",
        "score": 2,
        "created_utc": 1745735939.0,
        "is_submitter": false
      },
      {
        "id": "mp9vek6",
        "text": "Bottom line, you will get a better price on private sale compared to trade in.\n\nThat being said, $5600 for that bike will be a tough sell, you kind of got hosed with that price in my opinion. Doesn't matter how good of a condition it is, it's not a particularly sought after Harley. \n\nEither stick with it, take it slow, and increase your skill over time or sell it and just accept the loss as a learning moment.",
        "subreddit": "personalfinance",
        "score": 3,
        "created_utc": 1745735460.0,
        "is_submitter": false
      },
      {
        "id": "mp97dmi",
        "text": "Unfortunately not on PC. Console and S. Deck is what I use these days.",
        "subreddit": "gaming",
        "score": 1,
        "created_utc": 1745723497.0,
        "is_submitter": false
      },
      {
        "id": "mp8uvlz",
        "text": "Good point I, I didn't know about the CRT stuff. \n\nI dislike Patron for being an overhyped brand over the years and there are loads of better options for the money. Part of that comes from when I used to bartend and dealing with Patron customers maybe, definitely some inherent bias on my side.",
        "subreddit": "tequila",
        "score": 2,
        "created_utc": 1745718505.0,
        "is_submitter": false
      },
      {
        "id": "mp8r46p",
        "text": "The former for sure haha. I'm not expecting Call of Duty levels of wallrun/slide acrobatics ot of RDR, but yeah the general game mechanics felt very unresponsive and sluggish to me at the time.",
        "subreddit": "gaming",
        "score": 1,
        "created_utc": 1745717061.0,
        "is_submitter": false
      },
      {
        "id": "mp8q5wb",
        "text": "honestly I attempted it at one point, and I will probably get hate for this, but as much as I loved the story I found the mechanics of the game a bit grating. Everything just moved at a glacial pace. Walking is slow, running is slow, general movement I found to be slow. \n\nIt's one of those games that I'm certain I will go and play at one point, but I need to find a good time where I can actually just sit and focus to play it.",
        "subreddit": "gaming",
        "score": 6,
        "created_utc": 1745716692.0,
        "is_submitter": false
      }
    ],
    "total_posts": 32,
    "total_comments": 100,
    "fetch_method": "api"
  },
  "analysis": {
    "text_stats": {
      "total_texts": 132,
      "total_words": 13511,
      "avg_words_per_text": 102.35606060606061,
      "total_sentences": 717,
      "avg_sentences_per_text": 5.431818181818182,
      "most_common_words": [
        [
          "pretty",
          37
        ],
        [
          "bit",
          35
        ],
        [
          "get",
          33
        ],
        [
          "one",
          32
        ],
        [
          "like",
          31
        ],
        [
          "would",
          31
        ],
        [
          "time",
          30
        ],
        [
          "https",
          30
        ],
        [
          "good",
          25
        ],
        [
          "could",
          25
        ],
        [
          "see",
          21
        ],
        [
          "issue",
          21
        ],
        [
          "bag",
          19
        ],
        [
          "setup",
          19
        ],
        [
          "much",
          19
        ],
        [
          "sure",
          18
        ],
        [
          "days",
          18
        ],
        [
          "used",
          18
        ],
        [
          "use",
          17
        ],
        [
          "think",
          17
        ]
      ],
      "vocabulary_size": 2471
    },
    "sentiment": {
      "average_sentiment": {
        "compound": 0.29510909090909077,
        "positive": 0.1210681818181818,
        "negative": 0.05593939393939393,
        "neutral": 0.8230378787878789
      },
      "overall_sentiment": "positive",
      "sentiment_distribution": {
        "positive_posts": 77,
        "negative_posts": 30,
        "neutral_posts": 25
      }
    },
    "topics": [
      "you",
      "that",
      "this",
      "what",
      "which",
      "they",
      "anybody",
      "them",
      "something",
      "time",
      "amsterdam",
      "prague",
      "anything",
      "patagonia",
      "ibu"
    ],
    "interests": [
      "food",
      "technology",
      "movies",
      "gaming",
      "science",
      "music",
      "finance",
      "fitness"
    ],
    "personality_traits": {
      "analytical": 3.75,
      "creative": 40.0,
      "social": 15.625,
      "optimistic": 17.5,
      "humorous": 8.75,
      "technical": 1.25,
      "helpful": 13.125
    },
    "subreddit_activity": {
      "top_subreddits": [
        [
          "MT09",
          31
        ],
        [
          "houston",
          16
        ],
        [
          "GrandPowerStribog",
          13
        ],
        [
          "Homebrewing",
          11
        ],
        [
          "movies",
          8
        ],
        [
          "gundeals",
          8
        ],
        [
          "AskReddit",
          7
        ],
        [
          "onebag",
          4
        ],
        [
          "gaming",
          4
        ],
        [
          "tequila",
          4
        ]
      ],
      "total_subreddits": 30,
      "post_distribution": {
        "creepy": 1,
        "GrandPowerStribog": 1,
        "MT09": 1,
        "houston": 3,
        "tax": 1,
        "projectors": 1,
        "prisonhooch": 1,
        "backpacking": 1,
        "Homebrewing": 10,
        "frugalmalefashion": 2,
        "videos": 1,
        "loopdaddy": 1,
        "GoogleFi": 1,
        "onebag": 4,
        "MechanicAdvice": 1,
        "Strava": 1,
        "Insurance": 1
      },
      "comment_distribution": {
        "movies": 8,
        "MT09": 30,
        "gundeals": 8,
        "food": 1,
        "AskReddit": 7,
        "gaming": 4,
        "conan": 1,
        "houston": 13,
        "funny": 2,
        "motorcycles": 1,
        "videos": 1,
        "Homebrewing": 1,
        "GrandPowerStribog": 12,
        "tequila": 4,
        "IAmA": 3,
        "EarthPorn": 1,
        "FordTransitConnect": 1,
        "personalfinance": 2
      }
    },
    "temporal_patterns": {
      "hourly_distribution": {
        "10": 8,
        "23": 6,
        "7": 1,
        "21": 4,
        "15": 10,
        "1": 7,
        "8": 3,
        "16": 6,
        "13": 5,
        "9": 2,
        "12": 8,
        "22": 8,
        "0": 8,
        "18": 13,
        "14": 8,
        "19": 4,
        "17": 12,
        "3": 4,
        "11": 1,
        "2": 4,
        "5": 6,
        "6": 3,
        "20": 1
      },
      "daily_distribution": {
        "Monday": 27,
        "Friday": 17,
        "Sunday": 23,
        "Saturday": 9,
        "Tuesday": 34,
        "Wednesday": 13,
        "Thursday": 9
      },
      "most_active_hour": 18,
      "most_active_day": "Tuesday"
    },
    "engagement_patterns": {
      "avg_post_score": 22.59375,
      "max_post_score": 132,
      "total_post_karma": 723,
      "avg_comment_score": 3.2,
      "max_comment_score": 61,
      "total_comment_karma": 320,
      "post_to_comment_ratio": 0.24242424242424243,
      "content_preference": "comments"
    }
  },
  "generated_at": "2025-07-15T00:24:39.690526"
}